// ❕CALLBACK функції
// ❕Замикання
// ❕Стрілочні функції
// 🟩======================================================================================
// ❕Функція зворотного виклику (callback, колбек)
// ❕Функція може приймати інші функції як параметри
// ❕Функція яка передається іншій функції як аргумент називається функція зворотного виклику
//   (callback, колбек)
// ❕Функція яка приймає у якості параметрів інші функції або повертає функцію у якості результату
//  називається Функція вищого порядку (higher order function)
// 🟩======================================================================================

// // ❕callback це лише ім'я змінної, але найчастіше вони називаються саме так
// fnA = function (message, callback) {
//   console.log(message);
//   console.log(callback);
//   callback(100);
// };
// fnB = function (number) {
//   console.log(`Це лог при виклику fnB:`,number);
// };

// fnA(`Hello`, fnB);

// 🟩======================================================================================
// ❕Функція doMath(a,b,callback)

const doMath = function (a, b, callback) {
  const result = callback(a, b);

  console.log(result);
};
const add = function (x, y) {
  return x + y;
};
doMath(2, 3, add);
// 🟩======================================================================================
// ❕Відкладений виклик: реєстрація подій

// const buttonRef = document.querySelector(`.js-button`);

// 🟩======================================================================================
// ❕Відкладений виклик: геолокація

// window.navigator.geolocation.getCurrentPosition();

// 🟩======================================================================================
// ❕Відкладений викликЖ інтервали

// console.log(`В коді перед тіймацтом`);
// console.log("Через 3 секунди всередині колбека в таймацті");
// console.log("В коді після таймауту");
// 🟩======================================================================================
