// ПРАКТИКА

// // 1 vars
// const min = 5;
// const max = 13;
// let total = 0;

// // for from min to max з кроком в 1

// for (let i = min; i <= max; i += 1) {
//   // console.log(i);
//   // перевіряємо залишок від ділення

//   // if (i % 2 === 0) {
//   //   console.log(`парне:`, i);

//   //   total += i;
//   // }
//   if (i % 2 !== 0) {
//     console.log(`не парне:`, i);
//     continue;
//   }
//   console.log(`парне:`, i);
//   total += i;
// }

// // пишемо суму
// console.log(`total:`, total);

// ЗАДАЧІ
// ЗАДАЧА 1

// // // 1 vars
// let balance = 10000;
// const payment = 2000;

// //2
// console.log(
//   `Загальна вартість замовлення ${payment} кредитів.Перевіряємо кількість доступних коштів на рахунку`
// );
// // Якщо сума покупки не перевищує баланс виконати balance =  balance - payment;

// if (balance >= payment) {
//   console.log(`Ok`);

//   balance -= payment;

//   // Вивести повідомлення "На рахунку залишилось [число] кредитів"
//   console.log(`На рахунку залишилось ${balance} кредитів`);
// } else {
//   //Якщо недостатно коштів вивести повідомлення про це
//   console.log(`На рахунку недостатньо коштів`);
// }
// // вивести повідомлення про закінчення операції
// console.log(`Операція завершена`);

// ЗАДАЧА 2
// Напиши скрипт підрахунку суми замовлення зі знижка в залежності від витраченої суми за весь час (партнерська програма).
// -загальна сума витраченого зберігається в змінній totalSpend;
// -сума данного платежу зберігається в змінній payment;
// -знижка зберігається в змінній discount;

// -Якщо витрачено [від 100 до 1000) -бронзовий партнер, знижка 2%;
// -Якщо витрачено [від 1000 до 5000) -срібний партнер, знижка 5%;
// -Якщо витрачено [більше 5000 -золотий партнер, знижка 10%;
// -Якщо витрачено менше 100) -не партнер, знижка 0%;

// -В результаті вивести повідомлення "Оформлюємо замовлення на суму [сума] зі знижкою [знижка]%"

let totalSpend = 1200;
let payment = 500;
let discount = 0;

// &&-and, ||-or
if (totalSpend >= 100 && totalSpend < 1000) {
  console.log("Бронзовий партнер, знижка 2%");
  // 0.02 це 2%
  discount = 0.02;
} else if (totalSpend >= 1000 && totalSpend < 5000) {
  console.log("Срібний партнер, знижка 5%;");
  discount = 0.05;
} else if (totalSpend >= 5000) {
  console.log("Золотий партнер, знижка 10%;");
  discount = 0.1;
} else {
  console.log("В вас ще немає партнерської знижки");
  // discount = 0;
}
// payment = payment - payment * discount;
payment -= payment * discount;

console.log(
  `Сума вашого замовлення: ${payment} грн;
Ваша знижка: ${discount * 100}%;`
);
totalSpend += payment;
console.log(`Загальна сума витрачена вами в нашому магазині ${totalSpend} грн`);
// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%;'
// 'Золотий партнер, знижка 10%;'
// 'В вас ще немає партнерської знижки'
